{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "batch_input_shape": [null, 80, 80, 3], "dtype": "float32", "filters": 80, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "max_pooling2d_15", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 96, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "max_pooling2d_16", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_16", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_16", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "max_pooling2d_17", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_17", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "dropout_21", "class_name": "Dropout", "config": {"name": "dropout_21", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 164, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_21", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "max_pooling2d_18", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_18", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "dropout_22", "class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "max_pooling2d_19", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "dropout_23", "class_name": "Dropout", "config": {"name": "dropout_23", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_23", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "max_pooling2d_20", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "dropout_24", "class_name": "Dropout", "config": {"name": "dropout_24", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 192, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_24", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "max_pooling2d_21", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "dropout_25", "class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"name": "reshape_3", "class_name": "Reshape", "config": {"name": "reshape_3", "trainable": true, "target_shape": [4800]}, "inbound_nodes": [[["dropout_25", 0, 0, {}]]]}, {"name": "dense_guy_1", "class_name": "Dense", "config": {"name": "dense_guy_1", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"name": "dropout_26", "class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_guy_1", 0, 0, {}]]]}, {"name": "dense_guy_2", "class_name": "Dense", "config": {"name": "dense_guy_2", "trainable": true, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_26", 0, 0, {}]]]}, {"name": "dropout_27", "class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "rate": 0.15, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_guy_2", 0, 0, {}]]]}, {"name": "Age", "class_name": "Dense", "config": {"name": "Age", "trainable": true, "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]]}, {"name": "Gender", "class_name": "Dense", "config": {"name": "Gender", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_27", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["Age", 0, 0], ["Gender", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of10.bin", "group1-shard2of10.bin", "group1-shard3of10.bin", "group1-shard4of10.bin", "group1-shard5of10.bin", "group1-shard6of10.bin", "group1-shard7of10.bin", "group1-shard8of10.bin", "group1-shard9of10.bin", "group1-shard10of10.bin"], "weights": [{"name": "Age/kernel", "shape": [1024, 4], "dtype": "float32"}, {"name": "Age/bias", "shape": [4], "dtype": "float32"}, {"name": "Gender/kernel", "shape": [1024, 2], "dtype": "float32"}, {"name": "Gender/bias", "shape": [2], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [80], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "batch_normalization_17/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [164], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [164], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [164], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [164], "dtype": "float32"}, {"name": "batch_normalization_19/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_20/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_21/gamma", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [5, 5, 3, 80], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [80], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [5, 5, 80, 96], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [96], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [5, 5, 96, 128], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [5, 5, 128, 164], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [164], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [5, 5, 164, 192], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [192], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [5, 5, 192, 192], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [192], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [5, 5, 192, 192], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [192], "dtype": "float32"}, {"name": "dense_guy_1/kernel", "shape": [4800, 1024], "dtype": "float32"}, {"name": "dense_guy_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_guy_2/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "dense_guy_2/bias", "shape": [1024], "dtype": "float32"}]}]}